# 11. Числові типи даних

# Цілі числа (тип int)
age = 20
temperature = -5

# Дійсні числа (тип float)
height = 1.65
pi = 3.14159

# Комплексні числа (тип complex)
x = 100 + 3j

# 11.3 Арифметичні оператори

# +, додавання (addition)
print(5 + 3)  # 8
print(2.1 + 7)  # 9.1
print(-1 + 2)  # 1

x = -1.0
y = 1
print(x + y)  # 0.0

# -, віднімання (subtraction)
print(5 - 3)  # 2
print(2.1 - 7)  # -4.9
print(-1 - 2)  # -3

x = -1.0
y = 1
print(x - y)  # -2.0

# *, множення (multiplication)
print(5 * 3)  # 15
print(2.1 * 7)  # 14.700000000000001
print(-1 * 2)  # -2

x = -1.0
y = 1
z = x * y
print(z)  # -1.0

# /, ділення (division)
print(5 / 3)  # 1.6666666666666667
print(2.1 / 7)  # 0.3
print(-1 / 2)  # -0.5

x = -1.0
y = 1
z = x / y
print(z)  # -1.0

# %, взяття остачі від ділення(modulus)
print(7 % 3)  # 1
print(8 % 3)  # 2
print(4 % 2)  # 0

# **, піднесення до степеня(exponentiation)
print(2**3)  # 8
print(7**2)  # 49
print(3.1**2.2)  # 12.050240825798763

# //, ділення з округленням вниз(floor division)
print(3 // 2)  # 1
print(49 // 10)  # 4
print(2.7 // 3)  # 0.0

# 11.4 Арифметика з плаваючою точкою: проблеми та обмеження
print(0.1 + 0.2)  # 0.30000000000000004
print(2.1 * 7)  # 14.700000000000001

# округлення числа з плаваючою точкою
value = 2.1 * 7
print(round(value, 1))  # 14.7
# або без змінної:
print(round(2.1 * 7, 1))  # 14.7

# перетворення числа з плаваючою точкою в ціле число
print((int(2.1 * 10) * 7) / 10)  # 14.7
# або поетапно:
value = 2.1 * 10
print((value * 7) / 10)  # 14.7

print(7 / 3)  # 2 - результат округлено вниз!
print(7.0 / 3)  # 2.3333333333333335
